from attacut import tokenize
from sklearn.feature_extraction.text import CountVectorizer, TfidfTransformer
from sklearn.naive_bayes import MultinomialNB

#print(tokenize("ฉันหิวข้าว"))

#content
Xtrain = ["'สุริยะ' เป็นประธาน ‘รฟม.-BEM’ เซ็นรถไฟฟ้าสายสีส้มวันนี้ เสนอลดค่าโดยสารยาว 10 ปี เร่งก่อสร้างเปิดให้บริการตลอดเส้นทางปี'73",
          "ทีมข่าวเดลินิวส์ พาย้อนไทม์ไลน์ 'ทักษิณ ชินวัตร' ตั้งแต่เหยียบแผ่นดินไทย สู่ อิสรภาพ พ้นโทษเป็นพลเมืองเต็มตัว ในเดือน ส.ค.นี้ ...",
          "สภาฉลุย! อนุมัติงบประมาณเพิ่มเติม 1.22 แสนล้าน แจกเงินหมื่นดิจิทัลวอลเล็ต เสียงเห็นชอบ 297 ต่อ 164 ขณะที่พบ สส.ฝั่งรัฐบาลหาย 15 คน"
          "รัฐบาล เร่งผลักดันมาตรการกระตุ้นเศรษฐกิจ และมาตรการเยียวยาแรงงาน กระทรวงแรงงาน-คลัง แม่งานดันสารพัดมาตรการ ประคองผู้ใช้แรงงานและผู้ประกอบการ รับมือวิกฤตเศรษฐกิจ-โรงงานปิดกิจการ"
          "โฆษก รบ. โต้คนโจมตี กางไทม์ไลน์ รัฐบาลเศรษฐา ลดค่าไฟมาแล้ว 10 เดือน แจงงวด ก.ย.-ธ.ค.ยังไม่สรุป",
          "เด็กก้าวไกล ถามงบประมาณเพิ่มเติม 1.22 แสนล้าน แจกเงินหมื่นดิจิทัลวอลเล็ต เกษตรกรอยู่ตรงไหน ฟัง ธรรมนัส ชัดๆ ปุ๋ยคนละครึ่ง ยังไม่ยกเลิก ย้ำคนละเรื่องกับ เยียวยาไร่ละ 1 พัน",
          "นายกฯบอกแล้วแต่มุมมอง ชุดพิธีการนักกีฬา โอลิมปิก เกมส์ 2024",
          "”นายก​ฯ“ มอบอุปกรณ์​ป้องกันและตอบโต้กลุ่มผู้ค้ายาเสพติด​แก่ทบ.​- ตร.​",
          "นายกฯ ขอให้เกียรติผู้ออกแบบชุดพิธีการนักกีฬาไทย ร่วมพิธีเปิดการแข่งขันโอลิมปิกเกมส์ ปารีส 2024 ชี้ เรื่องแบบนี้ อยู่ที่สายตาแต่ละคน ขอโฟกัสเรื่องอื่นดีกว่า",
          ]
#who
Ytrain = ["สุริยะ","ทักษิณ","เงินดิจิทัล","นายก","นายก","นายก รัฐบาล","ก้าวไกล","เศรษฐา,นายก,รัฐมนตรี","นายก","นายก"]

Input_test = [""]

CountVectorizer(tokenizer = tokenize)

clf = MultinomialNB()

clf.fit


