# -*- coding: utf-8 -*-

import pandas as pd

# ข้อมูลตัวอย่าง
data = {
    'text': [
        'นายกฯพร้อมภริยา เป็นประธานพิธีเจริญพระพุทธมนต์ และพิธีทำบุญตักบาตรถวายพระราชกุศล เนื่องในโอกาสพระราชพิธีมหามงคลเฉลิมพระชนมพรรษา 6 รอบ 28 กรกฎาคม 2567',
        'งบฯเป๋าดิจิทัล1.2แสนล้าน เข้าสภา 31 ก.ค. ถกวาระ 2-3 ‘ก้าวไกล’ แปรญัตติอื้อ.',
        'นายกฯเศรษฐา ทวีสิน นำครม. และข้าราชการสัตย์ปฏิญาณ ขอเป็นข้าราชการที่ดี ขณะที่พสกนิกรน้อมใจถวายพระพรชัยมงคล เนื่องในพระราชพิธีมหามงคลเฉลิมพระชนมพรรษา 6 รอบ 28 กรกฎาคม 2567 ขอให้พระองค์ทรงพระเจริญยิ่งยืนนาน',
        'รัฐบาลเปิดให้เข้าชม #ภูพระบาท ฟรี! ตั้งแต่วันนี้ – 12 ส.ค. 67 พร้อมเดินหน้าผลักดันให้เกิดแหล่งมรดกโลกแห่งใหม่อย่างต่อเนื่อง',
        'ก้าวไกล ปล่อยคลิป จับตาคำวินิจฉัย คดียุบพรรค 7 ส.ค. 2567 ลั่นเดินหน้าต่อ จาก “อนาคตใหม่ สู่ก้าวไกล สู่อนาคต” ยุบได้แค่องค์กร ไม่สามารถหยุดอุดมการณ์ได้',
        'ก้าวไกล ดิ้นสู้ ยุบพรรค ปล่อยคลิปชวนดราม่า  ลั่นไม่สามารถหยุดชุดอุดมการณ์นี้ได้ ยันเดินหน้าต่อ ปชช.สงสัย เดินหน้าเรื่องอะไร?',
        '‘ก้าวไกล’ โพสต์เชิญ ปชช. ใส่เสื้อที่มีสัญลักษณ์พรรค ร่วมฟังคำวินิจฉัยคดียุบพรรค 7 ส.ค.นี้ อาคารอนาคตใหม่ พร้อมเปิดเสื้อคอลเล็คชั่นใหม่ล่าสุด Limited Edition เพื่อวันฟังคำวินิจฉัยศาลโดยเฉพาะ'
    ],
    'label': [
        'นายก',
        'รัฐบาล,นายก',
        'นายก',
        'รัฐบาล,นายก',
        'ก้าวไกล',
        'ก้าวไกล',
        'ก้าวไกล'
    ]
}

# สร้าง DataFrame
df = pd.DataFrame(data)

# บันทึกเป็นไฟล์ CSV
df.to_csv('data/data.csv', index=False, encoding='utf-8-sig')
